app/controllers/api/digs_controller.rb

  def index
    render json: Dig.order("owner_id").all
---
SELECT "digs".* FROM "digs"   ORDER BY owner_id

  def vote
   	user = User.find("1")
  	dig = Dig.find( params[:id] )
  	render json: dig.votes.create!(:voter => user, :amount => params[:amount])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "digs".* FROM "digs"  WHERE "digs"."id" = $1 LIMIT 1  [["id", 0]]
INSERT INTO "votes" ("amount", "created_at", "updated_at", "votable_id", "votable_type", "voter_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 1], ["created_at", "2014-11-22 23:59:40.425297"], ["updated_at", "2014-11-22 23:59:40.425297"], ["votable_id", 1], ["votable_type", "Dig"], ["voter_id", 1]]

  def update
  	dig = Dig.find(params[:id])
  	dig.update(dig_params)
---
SELECT  "digs".* FROM "digs"  WHERE "digs"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "digs" SET "body" = $1, "owner_id" = $2, "title" = $3, "updated_at" = $4 WHERE "digs"."id" = 1  [["body", "BODY BUILDER"], ["owner_id", 3], ["title", "First Jon's digg111"], ["updated_at", "2014-11-23 21:35:53.686786"]]

  def create
  	dig = current_user.digs.new(dig_params)
  	dig.save!
---
INSERT INTO "digs" ("body", "created_at", "owner_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Body Destruct"], ["created_at", "2014-11-23 21:34:40.228604"], ["owner_id", 3], ["title", "Basic title"], ["updated_at", "2014-11-23 21:34:40.228604"]]
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-23 13:02:09.923621"], ["email", "user@example.com"], ["updated_at", "2014-11-23 13:02:09.923621"]]

  def destroy
  	dig = Dig.find(params[:id])
  	dig.destroy
---
SELECT  "digs".* FROM "digs"  WHERE "digs"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "digs" WHERE "digs"."id" = $1  [["id", 6]]